
#=== Инициализация переменных для корректного подключения подпроектов ===================
include(cmake/vars.cmake)

#=== Подключение вспомогательных утилит для Qt5 =========================================
include(cmake/qt5.utils.cmake)

#****************************************************************************************
#*** Подключение проектов ***************************************************************
#****************************************************************************************
#=== Подключение AMSMDemo ===============================================================
   # Подключение проектов зависимостей
   include(cmake/deps_myapp.cmake)              # Подключение скрипта с описанием зависимостей
   include_directories(${APP_MYAPP_DEPS_INCLUDE})   # Хак для корректной работы модели кода QtCreator
   foreach(dep ${APP_MYAPP_DEPS})                   # Перебор всех элементов массива
      string(REGEX REPLACE "/" "_" VAR_DEP ${dep})        # Если указан путь с поддиректориями, то замена слеша на подчёркивание
      string(TOUPPER ${VAR_DEP} VAR_DEP)
      set(ON_FLAG ${${VAR_DEP}})
      if(NOT ON_FLAG OR "${ON_FLAG}" STREQUAL "OFF")
         set(${VAR_DEP} "ON")
         add_subdirectory(../../../${dep} ${PROJECT_BINARY_DIR}/${dep})
      endif()
   endforeach()

   # Формирование зависимостей сборки между подключёнными проектами
   set_myapp_deps()

   # Подключение проекта ПК
   add_subdirectory(../../../packages/mypoolapp/myapp ${PROJECT_BINARY_DIR}/mypoolapp/myapp)

